*** Snippets to Eval
#+BEGIN_SRC emacs-lisp
;; #+LaTeX_CLASS: beamer in org files
(unless (boundp 'org-export-latex-classes)
  (setq org-export-latex-classes nil))
(add-to-list 'org-export-latex-classes
  ;; beamer class, for presentations
  '("beamer"
     "\\documentclass[11pt]{beamer}\n
      \\mode<{{{beamermode}}}>\n
      \\usetheme{{{{beamertheme}}}}\n
      \\usecolortheme{{{{beamercolortheme}}}}\n
      \\beamertemplateballitem\n
      \\setbeameroption{show notes}
      \\usepackage[utf8]{inputenc}\n
      \\usepackage[T1]{fontenc}\n
      \\usepackage{hyperref}\n
      \\usepackage{color}
      \\usepackage{listings}
      \\lstset{numbers=none,language=[ISO]C++,tabsize=4,
  frame=single,
  basicstyle=\\small,
  showspaces=false,showstringspaces=false,
  showtabs=false,
  keywordstyle=\\color{blue}\\bfseries,
  commentstyle=\\color{red},
  }\n
      \\usepackage{verbatim}\n
      \\institute{{{{beamerinstitute}}}}\n
       \\subject{{{{beamersubject}}}}\n"

     ("\\section{%s}" . "\\section*{%s}")

     ("\\begin{frame}[fragile]\\frametitle{%s}"
       "\\end{frame}"
       "\\begin{frame}[fragile]\\frametitle{%s}"
       "\\end{frame}")))

  ;; letter class, for formal letters

  (add-to-list 'org-export-latex-classes

  '("letter"
     "\\documentclass[11pt]{letter}\n
      \\usepackage[utf8]{inputenc}\n
      \\usepackage[T1]{fontenc}\n
      \\usepackage{color}"

     ("\\section{%s}" . "\\section*{%s}")
     ("\\subsection{%s}" . "\\subsection*{%s}")
     ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
     ("\\paragraph{%s}" . "\\paragraph*{%s}")
     ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))


#+END_SRC

#+RESULTS:
| letter | \documentclass[11pt]{letter}\n\n      \usepackage[utf8]{inputenc}\n\n      \usepackage[T1]{fontenc}\n\n      \usepackage{color}                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s})                                                                  | (\subsubsection{%s} . \subsubsection*{%s}) | (\paragraph{%s} . \paragraph*{%s}) | (\subparagraph{%s} . \subparagraph*{%s}) |
| beamer | \documentclass[11pt]{beamer}\n\n      \mode<{{{beamermode}}}>\n\n      \usetheme{{{{beamertheme}}}}\n\n      \usecolortheme{{{{beamercolortheme}}}}\n\n      \beamertemplateballitem\n\n      \setbeameroption{show notes}\n      \usepackage[utf8]{inputenc}\n\n      \usepackage[T1]{fontenc}\n\n      \usepackage{hyperref}\n\n      \usepackage{color}\n      \usepackage{listings}\n      \lstset{numbers=none,language=[ISO]C++,tabsize=4,\n  frame=single,\n  basicstyle=\small,\n  showspaces=false,showstringspaces=false,\n  showtabs=false,\n  keywordstyle=\color{blue}\bfseries,\n  commentstyle=\color{red},\n  }\n\n      \usepackage{verbatim}\n\n      \institute{{{{beamerinstitute}}}}\n          \n       \subject{{{{beamersubject}}}}\n | (\section{%s} . \section*{%s}) | (\begin{frame}[fragile]\frametitle{%s} \end{frame} \begin{frame}[fragile]\frametitle{%s} \end{frame}) |                                            |                                    |                                          |

